import React from "react";
import "./SelfHelp.css";

const SelfHelpADHD = () => {
  return (
    <div className="selfhelp-container">
        <div className="selfhelp-text-block violet-bg">
            <h2 className="selfhelp-title">Поняття РДУГ та його ознаки у людини</h2>
        </div>

        <div className="selfhelp-text-block violet-bg">
            <p>РДУГ — це скорочення від «Розлад дефіциту уваги з гіперактивністю». Це невророзвитковий розлад, який впливає на здатність людини зосереджуватися, контролювати свої імпульси та рівень активності. Найчастіше він проявляється в дитячому віці, але у багатьох людей може зберігатися й у дорослому житті.</p>
            <p>Важливо розуміти, що РДУГ не є ознакою ліні чи небажання працювати. Це не просто каприз або «погане виховання», а справжня особливість роботи мозку. Багато людей із РДУГ володіють великим творчим потенціалом, нестандартним мисленням та здатністю працювати в надзвичайно динамічному середовищі.</p>
        </div>

        <div className="selfhelp-text-block violet-bg">
            <h2 className="selfhelp-subtitle">Типи РДУГ</h2>
            <p>Залежно від симптомів, виділяють <strong>три типи</strong>  (презентації) РДУГ:</p>
            <ul>
                <li><strong>Комбінований тип</strong>: протягом останніх шести місяців присутня достатня кількість симптомів неуважності та гіперактивності/імпульсивності;</li>
                <li><strong>Переважно неуважний тип</strong>: протягом останніх шести місяців присутня достатня кількість симптомів неуважності, але недостатньо симптомів гіперактивності/імпульсивності;</li>
                <li><strong>Переважно гіперактивний/імпульсивний тип</strong>: протягом останніх шести місяців присутня достатня кількість симптомів гіперактивності/імпульсивності, але недостатньо симптомів неуважності.</li>
            </ul>
            <p>Оскільки з віком симптоми можуть змінюватися, тип РДУГ теж може зазнати змін.</p>
        </div>

        <div className="selfhelp-text-block violet-bg">
            <h2 className="selfhelp-subtitle">Визначення й діагностичні критерії РДУГ відповідно до Діагностично-статистичного посібника з психічних розладів</h2>
            <p>У людей із РДУГ відмічається стійкий патерн до неуважності та/або гіперактивності/імпульсивності, що заважає функціонуванню або розвитку</p>
            <p>Неуважність (для постановки діагнозу в дітей до 16 років потрібна наявність шести й більше симптомів неуважності, в осіб віком від 17 років — п’яти й більше; симптоми неуважності мають бути присутніми щонайменше протягом шести місяців; пацієнт не відповідає рівню розвитку більшості людей свого віку):</p>
            <ul>
                <li>часто може бути неуважним (-ою) до деталей або помиляється з неуважності в шкільному навчанні, на роботі або в іншій діяльності;</li>
                <li>часто має труднощі з тим, щоб утримувати увагу під час виконання завдань або під час ігор;</li>
                <li>часто ніби не слухає, коли до нього/неї звертаються;</li>
                <li>здебільшого не виконує вказівок, не доводить розпочатого (наприклад, домашніх завдань, робочих чи домашніх обов'язків) до кінця, втрачає фокус, відволікається на сторонні подразники;</li>
                <li>часто має труднощі з організацією діяльності й виконанням завдань;
                зазвичай уникає завдань, які вимагають тривалого розумового напруження або зусиль (наприклад, роботи на уроці або виконання домашніх завдань);
                часто губить або забуває речі, необхідні для виконання завдань і діяльності (наприклад, зошити, ручки, підручники, інструменти, гаманець, ключі, документи, окуляри, мобільний телефон тощо);
                </li>
                <li>зазвичай легко відволікається;</li>
                <li>часто проявляє забудькуватість у повсякденних справах.</li>
            </ul>
            <p>Гіперактивність та імпульсивність (для постановки діагнозу в дітей до 16 років потрібна наявність шести й більше симптомів гіперактивності/імпульсивності, в осіб віком від 17 років — п’яти й більше; симптоми мають бути присутніми щонайменше протягом шести місяців; пацієнт не відповідає рівню розвитку більшості людей свого віку):</p>
            <ul>
                <li>часто спостерігають неспокійні рухи руками й ногами; сидячи на стільці, крутиться на місці;</li>
                <li>часто встає чи рухається в ситуаціях, коли потрібно залишатися на місці;</li>
                <li>часто демонструє безцільну рухову активність: бігає, намагається кудись залізти, причому робить це в ситуаціях, коли біганина чи інша активність недоречні (у підлітків і дорослих гіперактивність може зовні не проявлятися);</li>
                <li>часто не може тихо, спокійно гратися чи займатися чимось на дозвіллі;
                здебільшого постійно перебуває в русі й поводиться так, ніби йому/їй «установили двигун»;
                </li>
                <li>часто проявляє надмірну балакучість;</li>
                <li>часто вигукує відповіді раніше, ніж питання прозвучить до кінця;</li>
                <li>здебільшого має труднощі з очікуванням своєї черги;</li>
                <li>часто перебиває/втручається в розмови, ігри тощо.</li>
            </ul>
            <p><strong>Крім того, мають бути виконані такі умови:</strong></p>
            <ul>
                <li>поява кількох симптомів неуважності або гіперактивності/імпульсивності до 12 років;</li>
                <li>наявність кількох симптомів у кількох різних обставинах (наприклад, удома, у школі чи на роботі, у взаємодії з друзями чи родичами або в інших видах діяльності);</li>
                <li>наявність переконливих доказів того, що симптоми заважають чи знижують якість соціального, навчального або робочого функціонування;</li>
                <li>симптоми не можуть бути пояснені жодним іншим психічним розладом (наприклад, розладом настрою, тривожним розладом, дисоціативним розладом або розладом особистості); симптоми не виникають лише в контексті шизофренії чи іншого психотичного розладу.</li>
            </ul>
        </div>

        <div className="selfhelp-text-block violet-bg">
            <h2 className="selfhelp-subtitle">Діагностика РДУГ у дорослих</h2>
            <p>РДУГ часто зберігається й у дорослому віці. Для постановки діагнозу РДУГ особам віком від 17 років потрібна наявність лише п’яти симптомів (а не шести, як для дітей). У дорослому віці симптоми можуть мати інший вигляд. Наприклад, гіперактивність у дорослих може проявлятися як надмірний неспокій або активність, що виснажує навколишніх.</p>
        </div>
    </div>
  );
};

export default SelfHelpADHD;
